In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
people['email']

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.email

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [9]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [10]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [11]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [12]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1        JaneDoe@email.com      Doe

In [13]:
df.set_index('email')

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [14]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [15]:
 df.set_index('email', inplace=True)

In [16]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [17]:
df.index

Index(['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com'], dtype='object', name='email')

In [18]:
df.loc['CoreyMSchafer@gmail.com', 'last']

'Schafer'

In [19]:
df.iloc[0]

first      Corey
last     Schafer
Name: CoreyMSchafer@gmail.com, dtype: object

In [20]:
df.reset_index(inplace=True)
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [21]:
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [22]:
filt = (df['last'] == 'Doe')

In [23]:
df[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [24]:
df[df['last'] == 'Doe']

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [25]:
df.loc[filt, 'email']

1    JaneDoe@email.com
2    JohnDoe@email.com
Name: email, dtype: object

In [26]:
filt2 = (df['last'] == 'Doe') & (df['first'] == 'John')

In [27]:
df[filt2]

               email first last
2  JohnDoe@email.com  John  Doe

In [28]:
df.loc[filt2, 'email']

2    JohnDoe@email.com
Name: email, dtype: object

In [29]:
filt3 = (df['last'] == 'Schafer') | (df['first'] == 'John')

In [30]:
df.loc[filt3, 'email']

0    CoreyMSchafer@gmail.com
2          JohnDoe@email.com
Name: email, dtype: object

In [31]:
df.loc[~filt3, 'email']

1    JaneDoe@email.com
Name: email, dtype: object

In [32]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [33]:
df.columns = ['email', 'first_name', 'last_name']
df

                     email first_name last_name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [34]:
df.columns = [x.upper() for x in df.columns]
df

                     EMAIL FIRST_NAME LAST_NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [35]:
df.columns = df.columns.str.replace('_', ' ')
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [36]:
df.rename(columns={'FIRST NAME' : 'first', 'LAST NAME' : 'last' })

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [37]:
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [38]:
df.rename(columns={'FIRST NAME' : 'first', 'LAST NAME' : 'last' }, inplace=True)

In [39]:
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [40]:
df.loc[2] = ['JohnSmith@email.com', 'John', 'Smith']
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2      JohnSmith@email.com   John    Smith

In [41]:
df.loc[2, ['last', 'EMAIL']] = ['Doe', 'JohnDoe@email.com']
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [42]:
df.loc[2, 'last'] = 'Smith'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John    Smith

In [43]:
df.at[2, 'last'] = 'Doe'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [44]:
filt6 = (df['EMAIL'] == 'JohnDoe@email.com')
df[filt6]['last'] = 'Smith'

C:\Users\janek\AppData\Local\Temp\ipykernel_4616\3264677793.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt6]['last'] = 'Smith'

In [45]:
filt6 = (df['EMAIL'] == 'JohnDoe@email.com')
df.loc[filt6, 'last'] = 'Smith'
df

                     EMAIL  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John    Smith

In [46]:
df['EMAIL'] = df['EMAIL'].str.lower()
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@email.com   Jane      Doe
2        johndoe@email.com   John    Smith

In [47]:
df['EMAIL'].apply(len)

0    23
1    17
2    17
Name: EMAIL, dtype: int64

In [48]:
def update_email(email):
    return email.upper()

In [49]:
df['EMAIL'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: EMAIL, dtype: object

In [53]:
df['EMAIL'] = df['EMAIL'].apply(lambda x: x.lower())
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Corey  Schafer
1        janedoe@email.com   Jane      Doe
2        johndoe@email.com   John    Smith

In [54]:
df['EMAIL'].apply(len)

0    23
1    17
2    17
Name: EMAIL, dtype: int64

In [56]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [58]:
len(df['EMAIL'])

3

In [59]:
df.apply(pd.Series.min)

EMAIL    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

In [60]:
df.apply(lambda x: x.min())

EMAIL    coreymschafer@gmail.com
first                      Corey
last                         Doe
dtype: object

In [61]:
 df.applymap(len)

   EMAIL  first  last
0     23      5     7
1     17      4     3
2     17      4     5

In [62]:
df.applymap(str.lower)

                     EMAIL  first     last
0  coreymschafer@gmail.com  corey  schafer
1        janedoe@email.com   jane      doe
2        johndoe@email.com   john    smith

In [63]:
df['first'].map({'Corey' : 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [64]:
df['first'].replace({'Corey' : 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [65]:
df['first'] = df['first'].replace({'Corey' : 'Chris', 'Jane': 'Mary'})

In [66]:
df

                     EMAIL  first     last
0  coreymschafer@gmail.com  Chris  Schafer
1        janedoe@email.com   Mary      Doe
2        johndoe@email.com   John    Smith